var Config={  

    ver:101,
    URL:"http://www.hengshengsj.com/",

    type:{
        ssc:['1001','1003','1004','1010','1011'],     //时时彩
        syxw:['3001','3002','3003','3004'],                 //11选5
        pks:['2001'],                       //pk10
        gfsd:['4001','4002'],                        //管方3D
    },

    
    //玩法
    //时时彩 
    //父类   10 五星    11  四星   12 前三      13 中三         14 后三     15 前二
        //   16 后二    17 定位胆   18 不定位   19 大小单双      20 趣味
            //  

    //子类  10  直选复式    12 直选单式    13  组合    14 组选120  15 组选60
    //      16  组选30  17 组选20  18 组选10  19 组选5  20 组选24
    //      21  组选12  22 组选6  23 组选4  24 直选和值   25 组三
    //      26 组六         27 混合组选   28 一码不定位  29 二码不定位  30 组选复式
    //      31 组选单式     32 组选和值   33 五星一码不定位 34 五星二码不定位   35 五星三码不定位 
    //      36 前四一码不定位    37 前四二码不定位       38 后四一码不定位  39 后四二码不定位   40  前三一码不定位 
    //      41  前三二码不定位   42  后三一码不定位  43 后三二码不定位    44 中三一码不定位  45 中三二码不定位 
    //      46 前三       47 后三    48 前二    49  后二      50 一帆风顺
    //      51 好事成双     52 三星报喜   53 四季发财 54 龙虎
    //
    //          
    parentname:[//时时彩玩法名
                '','','','','','','','','','',
                '五星','四星','前三','中三','后三','前二',
                '后二','定位胆','不定位','大小单双','趣味',  
            
                //11选5  玩法名 21~26
                '三码','二码','定位胆','不定位','趣味',
                '任选复式','','','','',

                //pk10 玩法 31~38
                '定位胆','前五','前四','前三','前一',
                '龙虎','大小单双','和值','','',        
                
                //gf 41 ~ 46
                '三星','两星','定位胆','不定位','大小单双',
                '龙虎','','','','',
            ],

    sonname:[   '','','','','','','','','','',
                '直选','','直选单式','组合','组选120','组选60','组选30','组选20','组选10','组选5',
                '组选24','组选12','组选6','组选4','直选和值','组三','组六','混合组选','一码不定位','二码不定位',
                '组选复式','组选单式','组选和值','五星一码不定位','五星二码不定位','五星三码不定位','前四一码不定位','前四二码不定位','后四一码不定位','后四二码不定位',
                '前三一码不定位','前三二码不定位','后三一码不定位','后三二码不定位','中三一码不定位','中三二码不定位','前三','后三','前二','后二',
                '一帆风顺','好事成双','三星报喜','四季发财','龙虎','','','','','','',

                //11选5 玩法名 61~73
                '前三直选复式','前三组选复式','前二直选复式','前二组选复式','前三',
                '猜中位','任选一中一','任选二中二','任选三中三','任远四中四',
                '任选六中五','任选七中五','任选八中五','','',
                '','','','','',

                //pk10玩法 81~88
                '冠军','亚军','季军','第四名','第五名',
                '冠亚和值','冠亚和值大小单双','冠亚季和值','','',

                //gf 91~94
                '前二直选','后二直选','前二组选','后二组选',''
            ],

    style:{
        ssc:{
           parent:[10,11,12,13,14,15,16,17,18,19,20],

           son:[    [10,13,14,15,16,17,18,19 ],                    
                    [10,13,20,21,22,23], 
                    [10,13,24,25,26,32],
                    [10,13,24,25,26,32],
                    [10,13,24,25,26,32],
                    [10,24,30,32],
                    [10,24,30,32],
                    [11],
                    [33,34,35,36,37,38,39,40,41,42,43,44,45],
                    [46,47,48,49],
                    [50,51,52,53,54,55]]               
                   },
        syxw:{
            parent:[21,22,23,24,25,26],
            son:[   [61,62],
                    [63,64],
                    [11],
                    [65],
                    [66],
                    [67,68,69,70,71,72,73],           
            ],
        },
        pk10:{
            parent:[31,32,33,34,35,36,37,38],
            son:[   [11],
                    [11],
                    [11],
                    [11],
                    [11],
                    [81,82,83,84,85],
                    [11],
                    [86],//[86,87,88],
            ],
        },
        gfsd:{
            parent:[41,42,43,44,45,46],
            son:[   [10,24,25,26,32],
                    [91,92,93,94],
                    [11],
                    [28,29],
                    [48,49],
                    [11],
            ],
        },

    },

    // odds:[ [],

    // ],

    // rule:{
    //     ssc:{parent:[]},
    // }

    //投注消息
    // msg:{
    //     userid:'han',//抽注人id
        
    //     id:'1001',//奖种类ID
    //     dateid:'201807305023',//投注期号
    //     price:100,//单注价格
    //     count:5,//总注数
    //     totle:500,//总金额
    //     rule:'1021',//玩法类型
    //     //multiple:1,//倍数(预留,暂时不用)
    //      //投注号码
    //     num:[[  1,2,5,9],  //第一球选中的号
    //          [2,3,5],     //第二球选中的号
    //          [1,7,8,9],    //第三球选中的号
    //          [0,6],
    //          [2,5,8]],        
    // }
    

} ;
module.exports =  Config;